aws/amazon-freertos/projects/microchip/same70_xult/mplab/aws_tests/firmware/src/packs/ATSAME70Q21B_DFP/component/pio.h
#define   PIO_DRIVER_LINE24_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE24_LOW_DRIVE           (PIO_DRIVER_LINE24_LOW_DRIVE_Val << PIO_DRIVER_LINE24_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE24_HIGH_DRIVE          (PIO_DRIVER_LINE24_HIGH_DRIVE_Val << PIO_DRIVER_LINE24_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE25_Pos                 _U_(25)                                              /**< (PIO_DRIVER) Drive of PIO Line 25 Position */
#define PIO_DRIVER_LINE25_Msk                 (_U_(0x1) << PIO_DRIVER_LINE25_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 25 Mask */
#define PIO_DRIVER_LINE25(value)              (PIO_DRIVER_LINE25_Msk & ((value) << PIO_DRIVER_LINE25_Pos))
#define   PIO_DRIVER_LINE25_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE25_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE25_LOW_DRIVE           (PIO_DRIVER_LINE25_LOW_DRIVE_Val << PIO_DRIVER_LINE25_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE25_HIGH_DRIVE          (PIO_DRIVER_LINE25_HIGH_DRIVE_Val << PIO_DRIVER_LINE25_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE26_Pos                 _U_(26)                                              /**< (PIO_DRIVER) Drive of PIO Line 26 Position */
#define PIO_DRIVER_LINE26_Msk                 (_U_(0x1) << PIO_DRIVER_LINE26_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 26 Mask */
#define PIO_DRIVER_LINE26(value)              (PIO_DRIVER_LINE26_Msk & ((value) << PIO_DRIVER_LINE26_Pos))
#define   PIO_DRIVER_LINE26_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE26_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE26_LOW_DRIVE           (PIO_DRIVER_LINE26_LOW_DRIVE_Val << PIO_DRIVER_LINE26_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE26_HIGH_DRIVE          (PIO_DRIVER_LINE26_HIGH_DRIVE_Val << PIO_DRIVER_LINE26_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE27_Pos                 _U_(27)                                              /**< (PIO_DRIVER) Drive of PIO Line 27 Position */
#define PIO_DRIVER_LINE27_Msk                 (_U_(0x1) << PIO_DRIVER_LINE27_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 27 Mask */
#define PIO_DRIVER_LINE27(value)              (PIO_DRIVER_LINE27_Msk & ((value) << PIO_DRIVER_LINE27_Pos))
#define   PIO_DRIVER_LINE27_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE27_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE27_LOW_DRIVE           (PIO_DRIVER_LINE27_LOW_DRIVE_Val << PIO_DRIVER_LINE27_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE27_HIGH_DRIVE          (PIO_DRIVER_LINE27_HIGH_DRIVE_Val << PIO_DRIVER_LINE27_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE28_Pos                 _U_(28)                                              /**< (PIO_DRIVER) Drive of PIO Line 28 Position */
#define PIO_DRIVER_LINE28_Msk                 (_U_(0x1) << PIO_DRIVER_LINE28_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 28 Mask */
#define PIO_DRIVER_LINE28(value)              (PIO_DRIVER_LINE28_Msk & ((value) << PIO_DRIVER_LINE28_Pos))
#define   PIO_DRIVER_LINE28_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE28_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE28_LOW_DRIVE           (PIO_DRIVER_LINE28_LOW_DRIVE_Val << PIO_DRIVER_LINE28_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE28_HIGH_DRIVE          (PIO_DRIVER_LINE28_HIGH_DRIVE_Val << PIO_DRIVER_LINE28_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE29_Pos                 _U_(29)                                              /**< (PIO_DRIVER) Drive of PIO Line 29 Position */
#define PIO_DRIVER_LINE29_Msk                 (_U_(0x1) << PIO_DRIVER_LINE29_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 29 Mask */
#define PIO_DRIVER_LINE29(value)              (PIO_DRIVER_LINE29_Msk & ((value) << PIO_DRIVER_LINE29_Pos))
#define   PIO_DRIVER_LINE29_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE29_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE29_LOW_DRIVE           (PIO_DRIVER_LINE29_LOW_DRIVE_Val << PIO_DRIVER_LINE29_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE29_HIGH_DRIVE          (PIO_DRIVER_LINE29_HIGH_DRIVE_Val << PIO_DRIVER_LINE29_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE30_Pos                 _U_(30)                                              /**< (PIO_DRIVER) Drive of PIO Line 30 Position */
#define PIO_DRIVER_LINE30_Msk                 (_U_(0x1) << PIO_DRIVER_LINE30_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 30 Mask */
#define PIO_DRIVER_LINE30(value)              (PIO_DRIVER_LINE30_Msk & ((value) << PIO_DRIVER_LINE30_Pos))
#define   PIO_DRIVER_LINE30_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE30_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE30_LOW_DRIVE           (PIO_DRIVER_LINE30_LOW_DRIVE_Val << PIO_DRIVER_LINE30_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE30_HIGH_DRIVE          (PIO_DRIVER_LINE30_HIGH_DRIVE_Val << PIO_DRIVER_LINE30_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_LINE31_Pos                 _U_(31)                                              /**< (PIO_DRIVER) Drive of PIO Line 31 Position */
#define PIO_DRIVER_LINE31_Msk                 (_U_(0x1) << PIO_DRIVER_LINE31_Pos)                  /**< (PIO_DRIVER) Drive of PIO Line 31 Mask */
#define PIO_DRIVER_LINE31(value)              (PIO_DRIVER_LINE31_Msk & ((value) << PIO_DRIVER_LINE31_Pos))
#define   PIO_DRIVER_LINE31_LOW_DRIVE_Val     _U_(0x0)                                             /**< (PIO_DRIVER) Lowest drive  */
#define   PIO_DRIVER_LINE31_HIGH_DRIVE_Val    _U_(0x1)                                             /**< (PIO_DRIVER) Highest drive  */
#define PIO_DRIVER_LINE31_LOW_DRIVE           (PIO_DRIVER_LINE31_LOW_DRIVE_Val << PIO_DRIVER_LINE31_Pos) /**< (PIO_DRIVER) Lowest drive Position  */
#define PIO_DRIVER_LINE31_HIGH_DRIVE          (PIO_DRIVER_LINE31_HIGH_DRIVE_Val << PIO_DRIVER_LINE31_Pos) /**< (PIO_DRIVER) Highest drive Position  */
#define PIO_DRIVER_Msk                        _U_(0xFFFFFFFF)                                      /**< (PIO_DRIVER) Register Mask  */

#define PIO_DRIVER_LINE_Pos                   _U_(0)                                               /**< (PIO_DRIVER Position) Drive of PIO Line 3x */
#define PIO_DRIVER_LINE_Msk                   (_U_(0xFFFFFFFF) << PIO_DRIVER_LINE_Pos)             /**< (PIO_DRIVER Mask) LINE */
#define PIO_DRIVER_LINE(value)                (PIO_DRIVER_LINE_Msk & ((value) << PIO_DRIVER_LINE_Pos)) 

